import wed from '../../../../public/concept-of-seo-ranking-2040894 1.png';
import like81 from '../../../../public/icons81-like.png';
import { Link, NavLink } from "react-router-dom";

const Rights = () => {

    // const handle = () => {
    //     console.log(1);
    // }

    return (
    <div>
        <div className="px-10 pb-10 mt-[50px] w-[100%] rounded-xl shadow-[0px_0px_10px_2px_rgba(0,0,0,0.2)]">
            <div className='flex'>
                <img className='w-[3%] h-[2%] mt-10' src={like81} alt="" />
                <img className='mx-auto w-[600px] h-[600px]' src={wed} alt="" />
            </div>
            <h2 className='font-bold text-xl mb-10'> دوره پیشرفته هک و امنیت </h2>
            <p className='mb-5'> پیش نیاز ها هستند و اگد این پیشنیاز هارو رعایت نکنید ممکنه در مسیر آموزشی تون شکست بخورید !<br/>
                بپرسید شما رو به سمت برنامه نویسی هدایت میکنه و تهیید میکنه که این ها <br/>
                بسیاری از افرادی که هک علاقه مند هستند و غیره
            </p>
            <p className='mb-5'> پیش نیاز ها هستند و اگد این پیشنیاز هارو رعایت نکنید ممکنه در مسیر آموزشی تون شکست بخورید !<br/>
                بپرسید شما رو به سمت برنامه نویسی هدایت میکنه و تهیید میکنه که این ها <br/>
                بسیاری از افرادی که هک علاقه مند هستند و غیره
            </p>
            <p className='mb-5'> پیش نیاز ها هستند و اگد این پیشنیاز هارو رعایت نکنید ممکنه در مسیر آموزشی تون شکست بخورید !<br/>
                بپرسید شما رو به سمت برنامه نویسی هدایت میکنه و تهیید میکنه که این ها <br/>
                بسیاری از افرادی که هک علاقه مند هستند و غیره
            </p>
            <h3 className='mb-5'> 1- برنامه نویسی با دیدگاه یک هکر </h3>
            <h3 className='mb-5'> 2- شبکه با دیدکاه یک هکر </h3>
            <h3 className='mb-12'> 3- لینوکس با دیدگاه یک هکر </h3>
            <h2 className='mb-5'> 2.یک راهنما پیدا کنید</h2>
            <p className='mb-5'>
دریافت خواهید کرد و سرمایه اجتماعی خود را افزایش خواهید داد که همیشه در هر محیطی مفید است. این کار و اشتباهاتی که مرتکب شده راهنمایی بخواهید به این ترتیب شما مشاورههای شغلی ارزشمندی بگذارید تا شخصی را پیدا کنید<br/>
 که قبلا در جایگاهی بوده است که شما میخواهید باشید. در مورد نحوه انجام اگر میخواهید به بهترین توسعه دهنده در </p>
            <h2 className='mb-5'> 3. مهارتها و دانش خود را تقویت کنید</h2>
            <p className='mb-5'>
دریافت خواهید کرد و سرمایه اجتماعی خود را افزایش خواهید داد که همیشه در هر محیطی مفید است. این کار و اشتباهاتی که مرتکب شده راهنمایی بخواهید به این ترتیب شما مشاورههای شغلی ارزشمندی بگذارید تا شخصی را پیدا کنید<br/>
 که قبلا در جایگاهی بوده است که شما میخواهید باشید. در مورد نحوه انجام اگر میخواهید به بهترین توسعه دهنده در </p>

            <h2 className='mb-5'> 4.در جلسات و میتینگها صحبت کنید</h2>
            <p className='mb-5'>
دریافت خواهید کرد و سرمایه اجتماعی خود را افزایش خواهید داد که همیشه در هر محیطی مفید است. این کار و اشتباهاتی که مرتکب شده راهنمایی بخواهید به این ترتیب شما مشاورههای شغلی ارزشمندی بگذارید تا شخصی را پیدا کنید<br/>
 که قبلا در جایگاهی بوده است که شما میخواهید باشید. در مورد نحوه انجام اگر میخواهید به بهترین توسعه دهنده در </p>

            <NavLink className="block"> VS code </NavLink>
            <NavLink className="block"> SQL server </NavLink>
        </div>
    </div>
    );
}
 
export default Rights;
